def f22(x):
    a = (x & 0b111111111) << 17
    b = (x & 0b11111000000000) << 18
    c = (x & 0b111111111111111100000000000000) >> 13
    d = (x & 0b1000000000000000000000000000000) >> 4
    e = (x & 0b10000000000000000000000000000000) >> 31
    return a + b + c + d + e



def f23(table):
    # Удаление пустых столбцов
    for row in table:
        if row[1] is None:
            del row[1]

    # Преобразование 1-ого столбца
    for row in table:
        row[0] = row[0].split(" ")[2]

    # Преобразование 2-ого столбца
    for row in table:
        row[1] = "1" if row[1] == "Выполнено" else "0"

    # Преобразование 3-его столбца
    for row in table:
        arr = row[2].split("/")
        arr.reverse()
        row[2] = ".".join(arr)

    return table

print(f23([
    ["Дмитрий В. Фаробин", None, "Выполнено", "21/02/2004"],
    ["Григорий Е. Букудман", None, "Выполнено", "18/02/2004"],
    ["Рустам С. Фемский", None, "Выполнено", "07/01/2004"],
    ["Ильдар У. Бомянц", None, "Не выполнено", "08/04/2001"]]
))